IDEA Open Model
ParameterBool Class
Compatible with IDEA StatiCa v 10.1
 Boolean parameter of cross-section
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.CrossSection.Parameter
 IdeaRS.OpenModel.CrossSection.ParameterBool
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public class ParameterBool : Parameter
Public Class ParameterBool
	Inherits Parameter
public ref class ParameterBool : public Parameter
The ParameterBool type exposes the following members.
Constructors
Name | Description
ParameterBool
Initializes a new instance of the ParameterBool class
Top
Properties
Name | Description
Name
 Name of property
 (Inherited from Parameter.)
Value
 Value
Top
See Also
Reference
IdeaRS.OpenModel.CrossSection Namespace